# === Core CLI & Shell ===
brew "bash"
brew "bat"
brew "btop"
brew "ccrypt"
brew "colordiff"
brew "coreutils"
brew "eza"
brew "fish"
brew "fisher"
brew "fzf"
brew "grep"
brew "httpie"
brew "jq"
brew "mas"
brew "midnight-commander"
brew "moreutils"
brew "pinentry-mac"
brew "gnu-tar"
brew "starship"
brew "stow"
brew "thefuck"
brew "tig"
brew "tlrc"
brew "tmux"
brew "tmuxinator"
brew "unzip"
brew "wget"
brew "zellij"
brew "zoxide"

# === Git & GitHub ===
brew "act"
brew "gh"
brew "git"
brew "git-delta"
brew "git-gui"
brew "git-lfs"
brew "lazygit"

# === Dev & Languages ===
brew "go"
brew "rust"
brew "nvm"
brew "tenv"

# === Cloud & Containers ===
brew "awscli"
brew "cloud-sql-proxy"
brew "docker"
brew "k6"
brew "k9s"
brew "qemu"

# === Networking & Ops ===
brew "iperf3"
brew "nmap"
brew "rsync"
brew "speedtest-cli"

# === Media / Image / PDF ===
brew "ffmpeg"
brew "imagemagick"

# === Security & Certificates ===
brew "certbot"
brew "gnupg"

# === Casks ===
# -- Browsers --
cask "arc"
cask "chromium"
cask "firefox"
cask "firefox@developer-edition"
cask "google-chrome"
cask "google-chrome@canary"
cask "microsoft-edge"
cask "safari-technology-preview"

# -- Development --
#cask "android-studio"
cask "dbeaver-community"
cask "ghostty"
cask "github"
cask "gcloud-cli"
cask "imageoptim"
cask "lm-studio"
cask "ngrok"
cask "orbstack"
cask "postman"
cask "requestly"
cask "visual-studio-code"

# -- Productivity --
cask "1password"
cask "obsidian"
cask "onlyoffice"
cask "pdf-expert"
cask "raycast"
cask "slack"
cask "telegram"
cask "zoom"

# -- Design & Media --
cask "blender"
cask "figma"
cask "loom"
cask "spotify"
cask "vlc"

# -- Gaming --
cask "steam"

# -- Utilities --
cask "alt-tab"
cask "background-music"
cask "calibre"
cask "displaylink"
cask "glance-chamburr"
cask "keycastr"
cask "the-unarchiver"
cask "xquartz"

# -- Cloud & Networking --
cask "expressvpn"
cask "wireshark-app"

# -- Fonts --
cask "font-droid-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack"
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-source-sans-3"
cask "font-source-serif-4"

# === Mac App Store ===
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
#mas "CapCut", id: 1500855883
#mas "DaVinci Resolve", id: 571213070
mas "GIPHY CAPTURE", id: 668208984
mas "iMovie", id: 408981434
mas "Prime Video", id: 545519333
mas "Speedtest", id: 1153157709
mas "The Unarchiver", id: 425424353
mas "WhatsApp", id: 310633997
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835

# === VS Code Extensions ===
vscode "4ops.terraform"
vscode "dakshmiglani.hex-to-rgba"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "hashicorp.terraform"
vscode "kdl-org.kdl"
vscode "killalau.vscode-liquid-snippets"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vsliveshare.vsliveshare"
vscode "openai.chatgpt"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "sainoba.px-to-rem"
vscode "shopify.theme-check-vscode"
vscode "simonsiefke.svg-preview"
vscode "sissel.shopify-liquid"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "vitest.explorer"
vscode "vscodevim.vim"
